Запросы.ПростоКоннектор/src/Enums/ВариантыПроверкиУсловийВыгрузки/ВариантыПроверкиУсловийВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПроверкиУсловийВыгрузки</name>
  <enumValues>
    <name>ИсполняемыйКод</name>
  </enumValues>
  <enumValues>
    <name>СКД</name>
  </enumValues>
</mdclass:Enum>

Запросы.ПростоКоннектор/src/Enums/ВариантыВыгрузки/ВариантыВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВыгрузки</name>
  <enumValues>
    <name>ИсполняемыйКод</name>
  </enumValues>
  <enumValues>
    <name>Конструктор</name>
  </enumValues>
  <enumValues>
    <name>СКД</name>
  </enumValues>
  <enumValues>
    <name>КД2</name>
  </enumValues>
  <enumValues>
    <name>EnterpriseData</name>
  </enumValues>
</mdclass:Enum>

Запросы.ПростоКоннектор/src/Enums/Направление/Направление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Направление</name>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
</mdclass:Enum>

Запросы.ПростоКоннектор/src/Catalogs/ПравилаВыгрузкиДаннах/ПравилаВыгрузкиДаннах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаВыгрузкиДаннах</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыгрузки</name>
    <type>
      <types>EnumRef.ВариантыВыгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияВыгрузкиИсполныемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиУсловияВыгрузки</name>
    <type>
      <types>EnumRef.ВариантыПроверкиУсловийВыгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеВыгрузкиСКДУстановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФормата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКонвертации</name>
    <type>
      <types>CatalogRef.ПравилаКонвертации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Запросы.ПростоКоннектор/src/Catalogs/ПодключаемыеБазы/ПодключаемыеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемыеБазы</name>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВыгрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисИнтеграции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВыгрузкиЗагрузки</name>
    <type>
      <types>EnumRef.Форматы</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.Направление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиВыгрузкиДанных</name>
    <attributes>
      <name>Метаданные</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоВыгрузки</name>
      <type>
        <types>CatalogRef.ПравилаВыгрузкиДаннах</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбрать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиЗагрузки</name>
    <attributes>
      <name>ТипМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоЗагрузки</name>
      <type>
        <types>CatalogRef.ПравилаЗагрузкиДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Запросы.ПростоКоннектор/src/Catalogs/ПравилаЗагрузкиДанных/ПравилаЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЗагрузкиДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПравилаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыВыгрузки</types>
    </type>
  </attributes>
</mdclass:Catalog>

Запросы.ПростоКоннектор/src/CommonModules/Коннектор_БиблиотекаФункцийПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// <Описание функции>
// Получает настройки выгрузки для заданного объекта метаданных.
//
// Параметры:
//  ИмяМетаданных  - Тип: Строка, полное имя метаданных, для которого нужно определить настройки выгрузки.
//          
// Возвращаемое значение:
//   Массив - Список структур с настройками выгрузки, каждая структура содержит следующие поля: см НастройкаВыгрузкиПоУмолчанию()
//
Функция ПравилаВыгрузки(Знач ИмяМетаданных) Экспорт
	
	Ответ = Новый Массив;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК ПравилоСсылка,
		|	Спр.УсловияВыгрузкиИсполныемыйКод КАК УсловияВыгрузкиИсполныемыйКод,
		|	ВЫБОР
		|		КОГДА Спр.ВариантПроверкиУсловияВыгрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыПроверкиУсловийВыгрузки.СКД)
		|				И Спр.УсловиеВыгрузкиСКДУстановлено = ИСТИНА
		|			ТОГДА Спр.НастройкиСКД
		|		КОГДА Спр.ВариантВыгрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыВыгрузки.СКД)
		|			ТОГДА Спр.НастройкиСКД
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НастройкиСКД,
		|	Спр.ИсполняемыйКод КАК ИсполняемыйКод,
		|	Спр.ВариантПроверкиУсловияВыгрузки КАК ВариантПроверкиУсловияВыгрузки,
		|	Спр.КодПолучателя КАК КодПолучателя,
		|	Спр.Код КАК КодПравила,
		|	Спр.УсловиеВыгрузкиСКДУстановлено КАК УсловиеВыгрузкиСКДУстановлено,
		|	Спр.Источник КАК Источник,
		|	Спр.ВариантВыгрузки КАК ВариантВыгрузки,
		|	Спр.ВерсияФормата КАК ВерсияФормата,
		|	Спр.РасширениеФормата КАК РасширениеФормата,
		|	ВЫБОР
		|		КОГДА Спр.ВариантВыгрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыВыгрузки.КД2)
		|			ТОГДА Спр.ПравилоКонвертации.ХранилищеПравила
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ПравилоКонвертации,
		|	Коннектор_КаналОтправка.Значение КАК КаналОтправка
		|ИЗ
		|	Справочник.ПравилаВыгрузкиДаннах КАК Спр,
		|	Константа.Коннектор_КаналОтправка КАК Коннектор_КаналОтправка
		|ГДЕ
		|	Спр.Активно
		|	И Спр.Источник = &Источник
		|	И Спр.ПометкаУдаления = ЛОЖЬ
		|	И НЕ Коннектор_КаналОтправка.Значение ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Источник", ИмяМетаданных);
	Результат = Запрос.Выполнить(); 
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();  
		Пока Выборка.Следующий() Цикл
			
			Структура = НастройкаВыгрузкиПоУмолчанию();
			ЗаполнитьЗначенияСвойств(Структура, Выборка);
			
			Ответ.Добавить(Структура);	 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// <Описание функции>
// Возвращает стурктуру по умолчанию настроек правил выгрузки.
//
Функция НастройкаВыгрузкиПоУмолчанию() Экспорт

	Возврат Новый Структура("УсловияВыгрузкиИсполныемыйКод,
			|НастройкиСКД, ИсполняемыйКод, ВариантПроверкиУсловияВыгрузки,
			|КодПолучателя, КодПравила, УсловиеВыгрузкиСКДУстановлено, Источник, 
			|ВариантВыгрузки, ВерсияФормата, РасширениеФормата, ПравилоКонвертации, 
			|КаналОтправка, ПравилоСсылка");
	
КонецФункции

// <Описание функции>
// Получает настройки выгрузки для заданного объекта метаданных на основе активных подключаемых баз.
//
// Параметры:
//  Источник  - Тип: СправочникСсылка или ДокументСсылка - Объект метаданных, для которого нужно определить настройки выгрузки.
//              Должен быть объектом типа справочника или документа.
//
// Возвращаемое значение:
//   Массив - Список структур с настройками выгрузки, каждая структура содержит следующие поля:
//            * ИмяБазы           - Строка - Представление подключаемой базы данных.
//            * Префикс           - Строка - Префикс базы данных для выгрузки.
//            * Канал             - Строка - Канал интеграции.
//            * Сервис            - Строка - Сервис интеграции.
//            * ПравилоВыгрузки   - СправочникСсылка.ПравилаВыгрузкиДаннах - Правила выгрузки для объекта метаданных.
//   Ложь - Если нет активных подключаемых баз или правила выгрузки не найдены.
//
Функция ПолучитьНастройкиВыгрузкиБаз(Знач ИмяМетаданных) Экспорт
	
	// Выбор активных баз
	АктивныеБазы = ПолучитьАктивныеБазы();
	Если АктивныеБазы.Количество() = 0 Тогда
		Возврат Ложь;
	Конецесли; 
	
    // Формируем запрос для получения настроек выгрузки
	ПодключаемыеБазы = Новый Массив;
    Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", АктивныеБазы);
	Запрос.УстановитьПараметр("Метаданные", ИмяМетаданных);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодключаемыеБазыНастройкиВыгрузкиДанных.Ссылка.Представление КАК База,
	               |	ПодключаемыеБазыНастройкиВыгрузкиДанных.Ссылка.Канал КАК Канал,
	               |	ПодключаемыеБазыНастройкиВыгрузкиДанных.Ссылка.СервисИнтеграции КАК СервисИнтеграции,
	               |	ПодключаемыеБазыНастройкиВыгрузкиДанных.Ссылка.КодПолучателя КАК КодПолучателя,
	               |	ПравилаВыгрузкиДаннах.Наименование КАК ПравилоВыгрузки,
	               |	ПравилаВыгрузкиДаннах.ИсполняемыйКод КАК ИсполняемыйКод
	               |ИЗ
	               |	Справочник.ПодключаемыеБазы.НастройкиВыгрузкиДанных КАК ПодключаемыеБазыНастройкиВыгрузкиДанных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаВыгрузкиДаннах КАК ПравилаВыгрузкиДаннах
	               |		ПО ПодключаемыеБазыНастройкиВыгрузкиДанных.ПравилоВыгрузки = ПравилаВыгрузкиДаннах.Ссылка
	               |ГДЕ
	               |	ПодключаемыеБазыНастройкиВыгрузкиДанных.Ссылка В(&Ссылка)
	               |	И ПодключаемыеБазыНастройкиВыгрузкиДанных.Метаданные = &Метаданные
	               |	И ПодключаемыеБазыНастройкиВыгрузкиДанных.Выбрать
	               |	И ПравилаВыгрузкиДаннах.Ссылка <> ЗНАЧЕНИЕ(Справочник.ПравилаВыгрузкиДаннах.ПустаяСсылка)
	               |	И НЕ ПравилаВыгрузкиДаннах.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		// Формируем структуру для базы
		СтруктураПодключения = Новый Структура;
		СтруктураПодключения.Вставить("ИмяБазы", Выборка.База);
		СтруктураПодключения.Вставить("КодПолучателя", Выборка.КодПолучателя);
		СтруктураПодключения.Вставить("Канал", Выборка.Канал);
		СтруктураПодключения.Вставить("Сервис", Выборка.СервисИнтеграции);
		СтруктураПодключения.Вставить("ПравилоВыгрузки", Выборка.ПравилоВыгрузки);
		СтруктураПодключения.Вставить("ИсполняемыйКод", Выборка.ИсполняемыйКод);
		ПодключаемыеБазы.Добавить(СтруктураПодключения);
	КонецЦикла;	
	
	Если ПодключаемыеБазы.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПодключаемыеБазы;
КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьНастройкиЗагрузкиБаз(Знач ИмяМетаданных, ИсполняемыйКод) Экспорт
	
	// Выбор активных баз
	АктивныеБазы = ПолучитьАктивныеБазы();
	Если АктивныеБазы.Количество() = 0 Тогда
		Возврат Ложь;
	Конецесли; 
	
    // Формируем запрос для получения настроек загрузки
    Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", АктивныеБазы);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаЗагрузкиДанных.ИсполняемыйКод КАК ИсполняемыйКод,
	               |	ПравилаЗагрузкиДанных.Представление КАК Представление
	               |ИЗ
	               |	Справочник.ПодключаемыеБазы.НастройкиЗагрузки КАК ПодключаемыеБазыНастройкиЗагрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаЗагрузкиДанных КАК ПравилаЗагрузкиДанных
	               |		ПО ПодключаемыеБазыНастройкиЗагрузки.ПравилоЗагрузки = ПравилаЗагрузкиДанных.Ссылка
	               |			И ПодключаемыеБазыНастройкиЗагрузки.Ссылка.ФорматВыгрузкиЗагрузки = ПравилаЗагрузкиДанных.ФорматЗагрузки
	               |ГДЕ
	               |	ПодключаемыеБазыНастройкиЗагрузки.Ссылка.Ссылка В(&Ссылка)
	               |	И НЕ ПодключаемыеБазыНастройкиЗагрузки.Ссылка.ПометкаУдаления
	               |	И ПодключаемыеБазыНастройкиЗагрузки.ТипМетаданных = &ТипМетаданных
	               |	И НЕ ПравилаЗагрузкиДанных.ПометкаУдаления
	               |	И ПодключаемыеБазыНастройкиЗагрузки.Ссылка.Направление = ЗНАЧЕНИЕ(Перечисление.Направление.Загрузка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИсполняемыйКод = Выборка.ИсполняемыйКод;
	КонецЦикла;
	
КонецФункции

// <Описание функции>
// Получает версию БСП.
//
// Возвращаемое значение:
//   Строка версией БСП, либо пустая строка, если не удалось определить версию.
//
Функция ВерсияБСП() Экспорт
	
	Версия = "";
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") <> Неопределено Тогда
		Возврат СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
    КонецЕсли;      
	
КонецФункции
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// <Описание функции>
// Возвращает список ссылок на активные подключаемые базы данных.
//
// Параметры:
//   Нет
//
// Возвращаемое значение:
//   Массив - Массив ссылок на активные подключаемые базы данных.
//            Если активных баз нет, возвращается пустой массив.
//
Функция ПолучитьАктивныеБазы()
	ЗапросАктивныхБаз = Новый Запрос;
	ЗапросАктивныхБаз.Текст = "ВЫБРАТЬ
	                          |	ПодключаемыеБазы.Ссылка КАК Ссылка
	                          |ИЗ
	                          |	Справочник.ПодключаемыеБазы КАК ПодключаемыеБазы
	                          |ГДЕ
	                          |	ПодключаемыеБазы.Активна
	                          |	И НЕ ПодключаемыеБазы.ПометкаУдаления";
	
	Возврат ЗапросАктивныхБаз.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции 

Функция КомпонентыОбмена(Знач НаправлениеОбмена,
		Знач ВерсияФормата = "",
		Знач РасширениеФормата= "",
		Знач ВерсияФорматаОбменаПриЗагрузке = "",
		Знач РасширениеФорматаПриЗагрузке = "") Экспорт 
	
	КомпонентыОбмена     = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена(НаправлениеОбмена);
	ТекВерсияФормата     = ?(НаправлениеОбмена = "Отправка", ВерсияФормата, ВерсияФорматаОбменаПриЗагрузке);
	ТекРасширениеФормата = ?(НаправлениеОбмена = "Отправка", РасширениеФормата, РасширениеФорматаПриЗагрузке);
	КомпонентыОбмена.ЭтоОбменЧерезПланОбмена = Ложь;
	КомпонентыОбмена.КлючСообщенияЖурналаРегистрации = "Выгрузка в формате EnterpriseData";
	КомпонентыОбмена.ВерсияФорматаОбмена = ТекВерсияФормата;
	КомпонентыОбмена.XMLСхема = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/" + ТекВерсияФормата;
	ОбменДаннымиXDTOСервер.ВключитьПространствоИмен(КомпонентыОбмена, ТекРасширениеФормата, "ext");
	
	ВерсииФорматаОбмена = Новый Соответствие;
	ОбменДаннымиПереопределяемый.ПриПолученииДоступныхВерсийФормата(ВерсииФорматаОбмена);
	КомпонентыОбмена.МенеджерОбмена = ВерсииФорматаОбмена.Получить(ТекВерсияФормата);
	Если КомпонентыОбмена.МенеджерОбмена = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не поддерживается версия формата обмена: <%1>.'"), ТекВерсияФормата);
	КонецЕсли;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	ОбменДаннымиXDTOСервер.ПослеИнициализацииКомпонентыОбмена(КомпонентыОбмена);
	
	Возврат КомпонентыОбмена;
	
КонецФункции  

Функция ПравилаЗагрузкиДанных(КодПравила) Экспорт

	Возврат Справочники.ПравилаЗагрузкиДанных.ПравилаЗагрузки(КодПравила);
	
КонецФункции

#КонецОбласти
